uhnp/src/Catalogs/СпособыОтраженияРасходовПоАмортизацииМСФО/СпособыОтраженияРасходовПоАмортизацииМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияРасходовПоАмортизацииМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильРаспределенияНСБУ</name>
    <type>
      <types>DefinedType.ПрофильРаспределенияВНАНСБУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Тип должен совпадать с типом в РСБУ</comment>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Способы</name>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/InformationRegisters/ПорядокОтраженияНаСчетахУчета/ПорядокОтраженияНаСчетахУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияНаСчетахУчета</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>ОтноситсяКМалоценнымТМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаАналитикаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаМестоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долгосрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаРаздельныйНУ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработку</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданная</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненияВСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгосрочнойЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ПродажиПоЭквайрингу</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоДисконтированию</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоДисконтированиюРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоБронированию</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеПереданные</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеПроизводства</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ТМЦКСписанию</name>
  </enumValues>
  <enumValues>
    <name>ТМЦНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ТМЦУХранителей</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКомитентовКОформлениюПоЗакупке</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКомитентовКОформлениюПоПродаже</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПереданныеНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуУХранителей</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуКСписанию</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>НДСАвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>НДСАвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПотребленныеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТМЦПотребленныеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>АрендныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>НГЛС</name>
    <comment>Негарантированная ликвидационная стоимость</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентныйДисконт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыбытиеВНА</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыльОтОперацийПереоценки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СпособыОтраженияРасходовПоАмортизацииМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьОписание(Объект) Экспорт
	
	Описание = "";
	
	Если Объект.Способы.Количество() = 1 Тогда
		
		Описание = Описание 
			+ ДобавитьПоле("/СчетЗатрат", 	Объект.Способы[0].СчетЗатрат)
			+ ДобавитьПоле("/Субконто1", 	Объект.Способы[0].Субконто1)
			+ ДобавитьПоле("/Субконто2", 	Объект.Способы[0].Субконто2)
			+ ДобавитьПоле("/Субконто3", 	Объект.Способы[0].Субконто3)
		
	Иначе
		
		НомерСпособа = 1;
		Для каждого СтрокаСпособ Из Объект.Способы Цикл
		
			Описание = Описание
				+ ДобавитьПоле("/СчетЗатрат" + НомерСпособа, СтрокаСпособ.СчетЗатрат)
				+ ДобавитьПоле("/Субконто1", 	СтрокаСпособ.Субконто1)
				+ ДобавитьПоле("/Субконто2", 	СтрокаСпособ.Субконто2)
				+ ДобавитьПоле("/Субконто3", 	СтрокаСпособ.Субконто3)
				+ ДобавитьПоле("/Коэф.", 		СтрокаСпособ.Коэффициент);
		
			НомерСпособа = НомерСпособа + 1;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ?(Объект.Способы.Количество() > 1,  
		НСтр("ru = 'Способы: '"), "") + ?(Лев(Описание, 1) = "/", Сред(Описание, 2), 
		Описание);
	
КонецФункции

Функция ДобавитьПоле(Поле, Значение, Пропускать = Истина) 
	Возврат ?(ЗначениеЗаполнено(Значение), Строка(Поле) + ": " + Значение, "");
КонецФункции

Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	
	Субконто.Вставить(1, "Субконто1");
	Субконто.Вставить(2, "Субконто2");
	Субконто.Вставить(3, "Субконто3");
	Субконто.Вставить("Подразделение", "Подразделение");
	Субконто.Вставить("НаправлениеДеятельности", "НаправлениеДеятельности");
	
	Результат.Вставить("СчетЗатрат", Субконто);
	
	Возврат Результат;
	
КонецФункции

#Область ПрограммныйИнтерфейс

Функция ПолучитьСоздатьПрофильПоНСБУ(ПрофильНСБУ, ШаблонТрансляции = Неопределено, Отказ = Ложь) Экспорт

	Способ = Справочники.СпособыОтраженияРасходовПоАмортизацииМСФО
		.НайтиПоРеквизиту("ПрофильРаспределенияНСБУ", ПрофильНСБУ);

	Если НЕ ЗначениеЗаполнено(Способ) Тогда
		Возврат МСФОВНАВстраиваниеУХ.СоздатьПрофильРаспределенияПоНСБУ(
			ПрофильНСБУ, ШаблонТрансляции, Отказ);
	Иначе
		Возврат Способ;
	КонецЕсли;

КонецФункции

Функция ПолучитьСоздатьПрофильПоАналитике(СчетЗатрат, Субконто1 = Неопределено, Субконто2 = Неопределено, Субконто3 = Неопределено, СоздатьЕслиНеНайден = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Способы.Ссылка КАК Профиль
	|ИЗ
	|	Справочник.СпособыОтраженияРасходовПоАмортизацииМСФО.Способы КАК Способы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизацииМСФО.Способы КАК СпособыПрофиля
	|		ПО Способы.Ссылка = СпособыПрофиля.Ссылка
	|ГДЕ
	|	НЕ Способы.Ссылка.ПометкаУдаления
	|	И Способы.СчетЗатрат = &СчетЗатрат
	|	И Способы.Субконто1 = &Субконто1
	|	И Способы.Субконто2 = &Субконто2
	|	И Способы.Субконто3 = &Субконто3
	|
	|СГРУППИРОВАТЬ ПО
	|	Способы.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(СпособыПрофиля.НомерСтроки) = 1";
	
	Запрос.УстановитьПараметр("СчетЗатрат",	СчетЗатрат);
	Запрос.УстановитьПараметр("Субконто1",	Субконто1);
	Запрос.УстановитьПараметр("Субконто2", 	Субконто2);
	Запрос.УстановитьПараметр("Субконто3",	Субконто3);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Если СоздатьЕслиНеНайден Тогда
			Возврат СоздатьПрофильМСФО(СчетЗатрат, Субконто1, Субконто2, Субконто3);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Профиль;
	КонецЕсли;
	
КонецФункции

Функция СоздатьПрофильМСФО(СчетЗатрат, Субконто1 = Неопределено, Субконто2 = Неопределено, Субконто3 = Неопределено) Экспорт

	ОбъектПрофиль = Справочники.СпособыОтраженияРасходовПоАмортизацииМСФО.СоздатьЭлемент();

	ОбъектПрофиль.Комментарий = НСтр("ru = 'Создан автоматически'");
	ОбъектПрофиль.Наименование = "" + СчетЗатрат 
									+ ?(Субконто1 = Неопределено, "", ", " + Субконто1)
									+ ?(Субконто2 = Неопределено, "", ", " + Субконто2)
									+ ?(Субконто3 = Неопределено, "", ", " + Субконто3);
	
	Способ = ОбъектПрофиль.Способы.Добавить();
		
	Способ.СчетЗатрат = СчетЗатрат;
	Способ.Субконто1 = Субконто1;
	Способ.Субконто2 = Субконто2;
	Способ.Субконто3 = Субконто3;
	Способ.Коэффициент = 1;
		
	Попытка
		
		ОбъектПрофиль.ДополнительныеСвойства.Вставить("СозданиеАвтоматически", Истина);
		ОбъектПрофиль.ОбменДанными.Загрузка = Истина;
		ОбъектПрофиль.Записать();
		
	Исключение
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Не удалось создать профиль распределения по счету затрат: '");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения + СчетЗатрат);
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ОбъектПрофиль.Ссылка;	

КонецФункции

Функция ЗаполнитьПрофильМСФО(ПрофильРаспределения, ШаблонТрансляции = Неопределено) Экспорт
	
	ПрофильРаспределения.Наименование = Строка(ПрофильРаспределения.ПрофильРаспределенияНСБУ);
	Если ЗначениеЗаполнено(ШаблонТрансляции) Тогда
		ПрофильРаспределения.ПланСчетовБД = ШаблонТрансляции.ПланСчетовПриемник;
		ПрофильРаспределения.Способы.Загрузить(ПолучитьСпособыПоИсточнику(
			ПрофильРаспределения, ШаблонТрансляции));
	КонецЕсли;
	
	Если ПрофильРаспределения.Способы.Количество()=1 Тогда
		СтрокаИсточник = ПрофильРаспределения.Способы.Получить(0);
	Иначе 
		СтрокаИсточник = Новый Структура("СчетЗатрат, Субконто1, Субконто2, Субконто3"); // очищаем
	КонецЕсли;

	ПрофильРаспределения.СчетЗатрат 			= СтрокаИсточник.СчетЗатрат;
	ПрофильРаспределения.СчетЗатратСубконто1 	= СтрокаИсточник.Субконто1;
	ПрофильРаспределения.СчетЗатратСубконто2 	= СтрокаИсточник.Субконто2;
	ПрофильРаспределения.СчетЗатратСубконто3 	= СтрокаИсточник.Субконто3;
	
КонецФункции

#КонецОбласти

#Область СпособыТрансляцией

Функция ПолучитьСпособыПоИсточнику(ПрофильРаспределенияМСФО, ШаблонТрансляции, ТабСпособы = Неопределено) Экспорт
	
	Если Не УчетМСФОПовтИспУХ.ЕстьРСБУ() Тогда
		Возврат Новый ТаблицаЗначений;	
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	Если ТабСпособы = Неопределено Тогда
		ТекстЗапроса.Добавить(ТекстЗапроса_втСпособыПрофиляИсточника(НомераТаблиц));
	Иначе 
		ТекстЗапроса.Добавить(ТекстЗапроса_ТабСпособы(НомераТаблиц));
	КонецЕсли;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_БазаПрофиляИсточника(НомераТаблиц));
	ДобавитьЗапросы_СпособыПрофиляПриемника(ТекстЗапроса, НомераТаблиц, ШаблонТрансляции);
	
	Запрос = Новый Запрос(СтрСоединить(ТекстЗапроса, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета()));
	
	Запрос.УстановитьПараметр("ПрофильРаспределенияНСБУ", 	ПрофильРаспределенияМСФО.ПрофильРаспределенияНСБУ);
	Запрос.УстановитьПараметр("ПрофильРаспределенияМСФО", 	ПрофильРаспределенияМСФО.Ссылка);
	Запрос.УстановитьПараметр("ШаблонТрансляции", 			ШаблонТрансляции);
	Запрос.УстановитьПараметр("ТабСпособы", 				ТабСпособы);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДобавитьЗапросы_СпособыПрофиляПриемника(ТекстЗапроса, НомераТаблиц, ШаблонТрансляции)
	
	Процессор = МСФОЗапросыУХ.НовыйПроцессорТрансляцииЗапросом(ШаблонТрансляции);
	
	Процессор.ПутиИсключения.Добавить("Регистратор");
	Процессор.ИмяТаблицыИсточника = "ТаблицаИсточник";
	
	Процессор.ПоляИсточники.Вставить("Регистратор", "Ссылка");

	Процессор.СтороныТрансляции.Вставить("Трансляция", Истина); //Истина=Дебет
	
	Для каждого ПолеСтарое Из Процессор.ПоляИсточники Цикл
		ПолеНовое = СтрЗаменить(СтрЗаменить(ПолеСтарое.Ключ, "Кт",""), "Дт","");
		Процессор.ПоляИсточники[ПолеСтарое.Ключ] = ПолеНовое;
	КонецЦикла;
	
	ПараметрыЗамены = МСФОЗапросыУХ.ПодготовитьЗаменыПараметровТрансляции(Процессор);
	
	МСФОЗапросыУХ.ДобавитьЗапросыТрансляции(ТекстЗапроса, НомераТаблиц, ТекстЗапроса_СчетаИсточники());
	
	Шаблон = ШаблонЗапроса_СпособыПрофиляПриемника(НомераТаблиц);
	ТекстЗапроса.Добавить(МСФОЗапросыУХ.ЗаменитьПараметрыЗапроса(Шаблон, ПараметрыЗамены));
	
КонецПроцедуры

Функция ТекстЗапроса_ТабСпособы(НомераТаблиц)

	НомераТаблиц.Вставить("ТабСпособы", НомераТаблиц.Количество());
	
	Возврат  
	"ВЫБРАТЬ
	|	&ПрофильРаспределенияНСБУ КАК Ссылка,
	|	ЕстьNULL(РегистрМСФО.Регистратор, &ПрофильРаспределенияНСБУ) КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Счет КАК СчетИсточник,
	|	NULL КАК Подразделение,
	|	NULL КАК ПодразделениеДт,
	|	NULL КАК ПодразделениеКт,
	|	NULL КАК НаправлениеДеятельности,
	|	NULL КАК НаправлениеДеятельностиДт,
	|	NULL КАК НаправлениеДеятельностиКт,
	|	т.Субконто1 КАК Субконто1,
	|	т.Субконто2 КАК Субконто2,
	|	т.Субконто3 КАК Субконто3,
	|	т.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ втСпособыПрофиляИсточника
	|ИЗ
	|	&ТабСпособы КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.МСФО КАК РегистрМСФО
	|		ПО (ЛОЖЬ)";

КонецФункции

Функция ТекстЗапроса_втСпособыПрофиляИсточника(НомераТаблиц)

	НомераТаблиц.Вставить("втСпособыПрофиляИсточника", НомераТаблиц.Количество());
	//поле СчетИсточник используется в Запросах-трансляции

	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда

		Возврат
		"ВЫБРАТЬ
		|	ЕстьNULL(РегистрМСФО.Регистратор, т.Ссылка) КАК Ссылка,
		|	ЕстьNULL(РегистрМСФО.Регистратор, т.Ссылка) КАК Регистратор,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	1 КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	СчетБД.Ссылка КАК СчетИсточник,
		|	т.Подразделение КАК Подразделение,
		|	т.Подразделение КАК ПодразделениеДт,
		|	т.Подразделение КАК ПодразделениеКт,
		|	т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
		|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
		|	т.СтатьяРасходов КАК Субконто1,
		|	т.АналитикаРасходов КАК Субконто2,
		|	НЕОПРЕДЕЛЕНО КАК Субконто3,
		|	1 КАК Коэффициент
		|ПОМЕСТИТЬ втСпособыПрофиляИсточника
		|ИЗ
		|	Справочник.СпособыОтраженияРасходовПоАмортизацииМСФО КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК п
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаБД КАК СчетБД
		|			ПО п.СчетУчета = СчетБД.СчетСсылка
		|				И (НЕ СчетБД.ПометкаУдаления)
		|		ПО т.СтатьяРасходов.ГруппаФинансовогоУчетаРегл = п.АналитикаУчета
		|			И (п.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы))
		|			И (п.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|			И (п.МестоУчета = НЕОПРЕДЕЛЕНО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.МСФО КАК РегистрМСФО
		|		ПО (ЛОЖЬ)
		|ГДЕ
		|	т.Ссылка = &ПрофильРаспределенияМСФО";
		
	КонецЕсли;

	Возврат
	"ВЫБРАТЬ
	|	ЕстьNULL(РегистрМСФО.Регистратор, т.Ссылка) КАК Ссылка,
	|	ЕстьNULL(РегистрМСФО.Регистратор, т.Ссылка) КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	т.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
	|	СчетБД.Ссылка КАК СчетИсточник,
	|	т.ПодразделениеОрганизации КАК Подразделение,
	|	т.ПодразделениеОрганизации КАК ПодразделениеДт,
	|	т.ПодразделениеОрганизации КАК ПодразделениеКт,
	|	NULL КАК НаправлениеДеятельности,
	|	NULL КАК НаправлениеДеятельностиДт,
	|	NULL КАК НаправлениеДеятельностиКт,
	|	т.Субконто1 КАК Субконто1,
	|	т.Субконто2 КАК Субконто2,
	|	т.Субконто3 КАК Субконто3,
	|	т.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ втСпособыПрофиляИсточника
	|ИЗ
	|	Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаБД КАК СчетБД
	|		ПО т.СчетЗатрат = СчетБД.СчетСсылка
	|			И (НЕ СчетБД.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.МСФО КАК РегистрМСФО
	|		ПО (ЛОЖЬ)
	|ГДЕ
	|	т.Ссылка = &ПрофильРаспределенияНСБУ"; 
	
КонецФункции

Функция ТекстЗапроса_БазаПрофиляИсточника(НомераТаблиц)

	НомераТаблиц.Вставить("втБазаПрофиля", НомераТаблиц.Количество());
	
	Возврат  
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(т.Коэффициент) = 0
	|			ТОГДА 1
	|		ИНАЧЕ СУММА(т.Коэффициент)
	|	КОНЕЦ КАК База
	|ПОМЕСТИТЬ втБазаПрофиля
	|ИЗ
	|	втСпособыПрофиляИсточника КАК т"; 

КонецФункции

Функция ТекстЗапроса_СчетаИсточники()

	Возврат
	"ВЫБРАТЬ
	|	т.СчетИсточник КАК СчетИсточник
	|ИЗ
	|	втСпособыПрофиляИсточника КАК т";

КонецФункции

Функция ШаблонЗапроса_СпособыПрофиляПриемника(НомераТаблиц)
	
	НомераТаблиц.Вставить("втСпособыПрофиляИсточника", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втТрансляция.СчетПриемник КАК СчетЗатрат,
	|	втТрансляция.ИД КАК _ИД,
	|	&Трансляция_Подразделение КАК Подразделение,
	|	&Трансляция_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&Трансляция_Субконто1 КАК Субконто1,
	|	&Трансляция_Субконто2 КАК Субконто2,
	|	&Трансляция_Субконто3 КАК Субконто3,
	|	ТаблицаИсточник.Коэффициент * 100 / втБазаПрофиля.База КАК Коэффициент
	|ИЗ
	|	втСпособыПрофиляИсточника КАК ТаблицаИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБазаПрофиля КАК втБазаПрофиля
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПравилаПолей КАК втТрансляция
	|		ПО ТаблицаИсточник.СчетИсточник = втТрансляция.СчетИсточник
	|			И (втТрансляция.ТрансляцияДебет)
	|			И (ВЫБОР
	|				КОГДА втТрансляция.ПрименениеПоКорреспонденции
	|					ТОГДА ТаблицаИсточник.СчетИсточник = втТрансляция.КоррСчетСсылка
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НЕ втТрансляция.ЕстьОтборы
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ &Трансляция_Отбор
	|			КОНЕЦ)
	|ГДЕ
	|	втТрансляция.СчетПриемник <> ЗНАЧЕНИЕ(Справочник.СчетаБД.ПустаяСсылка)";
	
КонецФункции

#КонецОбласти

#КонецЕсли
